list.append(x) 
#добавляет элемент x в конец списка
list.extend(L) 
#добавляет все элементы списка L в конец списка
list.insert(i, x) 
#вставляет элемент x в позицию перед индексом i в списке
list.remove(x) 
#удаляет первый элемент x из списка
list.pop(i) 
#удаляет элемент с индексом i и возвращает его
list.index(x) 
#возвращает индекс первого элемента x в списке
list.count(x) 
#возвращает количество вхождений элемента x в список
list.sort() 
#сортирует элементы списка по возрастанию (ASCII)
list.reverse() 
#обращает порядок следования элементов